[
    {
        "title": "1908 - 1946",
        "entries": [
            {
                "year": 1908,
                "title": "Utworzenie klubu",
                "description": "Klub zostaje założony przez Bertholda Hornbergera, Oskara Muellera i Gustawa Milnikela pod nazwą Lodzer Fussballklub (Łódzki Klub Piłkarski) „Victoria”."
            },
            {
                "year": 1912,
                "title": "Największy sukces",
                "description": "KS Victoria Łódź zajmuje drugie miejsce w rozgrywkach o mistrzostwo Łodzi (Puchar Smitha i Gilchrista) ulegając w finale ekipie Łódzkiego Klubu Sportowego."
            },
            {
                "year": 1913,
                "title": "Zmiana zarządu",
                "description": "W latach 1913-14 zarząd klubu tworzyli: Willy Piechler – prezes, Edward Hube – wiceprezes, Willy Lichmaniak – sekretarz, Paul Petschke – skarbnik. W tym okresie klub liczył 68 członków."
            },
            {
                "year": 1914,
                "title": "Zawieszenie działalności",
                "description": "W momencie wybuchu I Wojny Światowej działalność klubu została zawieszona. Po odzyskaniu niepodległości przez Polskę klub nie wznowił działalności. W dwudziestoleciu międzywojennym nazwa „Victoria” nie pojawia się już na mapie łódzkiego sportu."
            },
            {
                "year": 1946,
                "title": "Ponowne powstanie klubu",
                "description": "W sierpniu 1946 powstaje nowy Robotniczy Klub Sportowy „Victoria”. Odnosi kolejne zwycięstwa przy udziale takich zawodników jak Karasiewicz, Ratyński, Różycki, Nowicki, Szydzisz czy Wasiak."
            }
        ]
    },
    {
        "title": "1956 - 1993",
        "entries": [
            {
                "year": 1956,
                "title": "Rozpad Klubu Sportowego „Włókniarz” Łódź",
                "description": "KS „Włókniarz” Łódź dzieli się na dwa kluby - ŁKS oraz Dziewiarski Klub Sportowy. Reszta zawodników i członków sztabu, ktorzy nie dołączyli do żadnej z ekip tworzą nowy Włókienniczy Klub Sportowy „Victoria”."
            },
            {
                "year": 1957,
                "title": "Awans do A klasy",
                "description": "W marcu 1957 roku po wygranym barażu z drużyną „ZWAT” Łódź (6:0), piłkarze „Victorii” biorą udział w rozgrywkach II grupy klasy „A”. Zajmują w niej ostatnie, dwunaste miejsce i tym samym zaznają goryczy porażki."
            },
            {
                "year": 1958,
                "title": "Fuzja klubów",
                "description": "„Victoria” łączy się z K.S. „Orion” oraz (ponownie) z Dziewiarskim K.S. i powstaje (ponownie) K.S. „Włókniarz”."
            },
            {
                "year": 1990,
                "title": "Powstanie Klubu Piłkarskiego „Victoria”",
                "description": "W 1990 roku, jak podaje w krótkiej wzmiance „Księga Pamiątkowa z okazji 80-lecia łódzkiego OZPN”, powstaje Klub Piłkarski (?) „Victoria”."
            },
            {
                "year": 1993,
                "title": "Powstanie klubu „Victoria-Włókniarz”",
                "description": "Działalność w latach 1990-1993 nie jest nam znana. Niewyjaśniona jest także droga Klubu do fuzji z „Włókniarzem”. Od sezonu 1993/94 do 1995/96 klub bierze udział w rozgrywkach IV ligi."
            }
        ]
    },
    {
        "title": "1994 - 1996",
        "entries": [
            {
                "year": 1994,
                "title": "Zdobycie mistrzostwa",
                "description": "W 1994 roku piłkarze zdobyli Wojewódzki Puchar Polski, pokonując w finałowym meczu rezerwy ŁKS 3:1. Premierowy (i jak na razie ostatni) mecz PP na szczeblu centralnym z Mazovią Rawa Maz. zakończył się porażką 0:3."
            },
            {
                "year": 1996,
                "title": "Spadek z IV ligii",
                "description": "Na koniec sezonu 1995/96 „Victoria” spada z czwartej ligi. Degradacja oznacza również koniec fuzji oraz współpracy „Victorii” i „Włókniarza”. „Victoria” rozpoczyna szukanie nowej siedziby. Zgromadzeni wokół Klubu działacze wybrali jego pierwsze władze w składzie: Grzegorz Hynek - Prezes, Janusz Matusiak - Wiceprezes ds. organizacyjnych, Zdzisław Cieślarczyk, Paweł Ciszewski i Paweł Mielczarek - Członkowie Zarządu. W skład Komisji Rewizyjnej weszli: Ireneusz Teśluk - Przewodniczący oraz Barbara Michalak i Grażyna Skowron, Janusz Jaworski – Członkowie Komisji."
            }
        ]
    }
]